In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.read_csv("csv1.csv")

In [3]:
df2 = df.copy()

In [4]:
df2

    id          name   age country   gender   income
0    1      John Doe  29.0     USA     Male  55000.0
1    1      John Doe  29.0     USA     Male  55000.0
2    2    Jane Smith   NaN  Canada   Female  62000.0
3    3          Alex   NaN     USA  Unknown  47000.0
4    4  Maria Garcia  34.0   Spain   Female      NaN
5    5        Li Wei  27.0   China     Male  51000.0
6    6           NaN  45.0   India   Female  73000.0
7    7    Ahmed Khan  38.0     NaN     Male  68000.0
8    8    Rachel Lee  29.0     USA   Female  62000.0
9    9   Carlos Ruiz   NaN  Mexico     Male  45000.0
10  10   Emily Davis  31.0     USA      NaN  58000.0

# Move ID to the end of the columns

In [5]:
new_col_order = [col for col in df.columns if col != "id"] + ["id"]
df2[new_col_order]

            name   age country   gender   income  id
0       John Doe  29.0     USA     Male  55000.0   1
1       John Doe  29.0     USA     Male  55000.0   1
2     Jane Smith   NaN  Canada   Female  62000.0   2
3           Alex   NaN     USA  Unknown  47000.0   3
4   Maria Garcia  34.0   Spain   Female      NaN   4
5         Li Wei  27.0   China     Male  51000.0   5
6            NaN  45.0   India   Female  73000.0   6
7     Ahmed Khan  38.0     NaN     Male  68000.0   7
8     Rachel Lee  29.0     USA   Female  62000.0   8
9    Carlos Ruiz   NaN  Mexico     Male  45000.0   9
10   Emily Davis  31.0     USA      NaN  58000.0  10

# Writing to csv files

In [29]:
df3 = df.copy()

df3 = df3.drop_duplicates()

df3 = df3.fillna(0)

df3 = df3.sort_values("income")

df3 = df3.reset_index(drop=True)

In [30]:
df3

   id          name   age country   gender   income
0   4  Maria Garcia  34.0   Spain   Female      0.0
1   9   Carlos Ruiz   0.0  Mexico     Male  45000.0
2   3          Alex   0.0     USA  Unknown  47000.0
3   5        Li Wei  27.0   China     Male  51000.0
4   1      John Doe  29.0     USA     Male  55000.0
5  10   Emily Davis  31.0     USA        0  58000.0
6   2    Jane Smith   0.0  Canada   Female  62000.0
7   8    Rachel Lee  29.0     USA   Female  62000.0
8   7    Ahmed Khan  38.0       0     Male  68000.0
9   6             0  45.0   India   Female  73000.0

In [33]:
df3.to_csv("sorted_data.csv", index=False)   # to renew index

In [35]:
json_string = df3.to_json()
print(json_string)

{"id":{"0":4,"1":9,"2":3,"3":5,"4":1,"5":10,"6":2,"7":8,"8":7,"9":6},"name":{"0":"Maria Garcia","1":"Carlos Ruiz","2":"Alex","3":"Li Wei","4":"John Doe","5":"Emily Davis","6":"Jane Smith","7":"Rachel Lee","8":"Ahmed Khan","9":0},"age":{"0":34.0,"1":0.0,"2":0.0,"3":27.0,"4":29.0,"5":31.0,"6":0.0,"7":29.0,"8":38.0,"9":45.0},"country":{"0":"Spain","1":"Mexico","2":"USA","3":"China","4":"USA","5":"USA","6":"Canada","7":"USA","8":0,"9":"India"},"gender":{"0":"Female","1":"Male","2":"Unknown","3":"Male","4":"Male","5":0,"6":"Female","7":"Female","8":"Male","9":"Female"},"income":{"0":0.0,"1":45000.0,"2":47000.0,"3":51000.0,"4":55000.0,"5":58000.0,"6":62000.0,"7":62000.0,"8":68000.0,"9":73000.0}}